ventas1/app/controllers/clientes_controller.rb

INSERT INTO "clientes" ("apellido", "created_at", "direccion", "fono", "nombre", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["apellido", "Cisternas"], ["created_at", "2015-10-30 23:12:01.124333"], ["direccion", "Condell 1415"], ["fono", "92519502"], ["nombre", "Luciano"], ["updated_at", "2015-10-30 23:12:01.124333"]]
---
  def create
    @cliente = Cliente.new(cliente_params)
    @cliente.save