ventas1/app/controllers/pedidos_controller.rb

SELECT "pedidos".* FROM "pedidos"
---
  def index
    @pedidos = Pedido.all

INSERT INTO "pedidos" ("cliente_id", "created_at", "producto_id", "updated_at") VALUES (?, ?, ?, ?)  [["cliente_id", 0], ["created_at", "2015-11-03 23:11:39.140444"], ["producto_id", 1], ["updated_at", "2015-11-03 23:11:39.140444"]]
---
  def create
    @pedido = Pedido.new(pedido_params)
    @pedido.save

SELECT  "pedidos".* FROM "pedidos"  WHERE "pedidos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_pedido
      @pedido = Pedido.find(params[:id])