ventas1/app/controllers/productos_controller.rb

SELECT "productos".* FROM "productos"
---
  def index
    @productos = Producto.all

INSERT INTO "productos" ("created_at", "detalle", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-10-30 23:11:09.579436"], ["detalle", "54 piezas"], ["nombre", "Promo 1"], ["updated_at", "2015-10-30 23:11:09.579436"]]
---
  def create
    @producto = Producto.new(producto_params)
    @producto.save

SELECT  "productos".* FROM "productos"  WHERE "productos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_producto
      @producto = Producto.find(params[:id])