app/controllers/preferencials_controller.rb

  def index
    @preferencials = Preferencial.all
---
SELECT "preferencials".* FROM "preferencials"

  def create
    @preferencial = Preferencial.new(preferencial_params)
    @preferencial.save
---
INSERT INTO "preferencials" ("cliente_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["cliente_id", 0], ["created_at", "2015-11-03 23:36:06.746332"], ["updated_at", "2015-11-03 23:36:06.746332"]]

    def set_preferencial
      @preferencial = Preferencial.find(params[:id])
---
SELECT  "preferencials".* FROM "preferencials"  WHERE "preferencials"."id" = ? LIMIT 1  [["id", 4]]